Revit 2024 API
RevolvedFace.Intersect Method
Calculates the intersection of the specified curve with this face.
Overload List
Name | Description
Intersect(Curve)
Calculates the intersection of the specified curve with this face.
 (Inherited from Face.)
Intersect(Face)
Calculates the intersection of the specified face with this face and returns the intersection results.
 (Inherited from Face.)
Intersect(Curve, IntersectionResultArray)
Calculates the intersection of the specified curve with this face and returns the intersection results.
 (Inherited from Face.)
Intersect(Face, Curve)
Calculates the intersection of the specified face with this face and returns the intersection results.
 (Inherited from Face.)
See Also
RevolvedFace Class
RevolvedFace Members
Autodesk.Revit.DB Namespace